from typing import ClassVar

import numpy as np

from .rosenbrock import AbstractRosenbrock, RosenbrockTableau


_tableau = RosenbrockTableau(
    a_lower=(
        np.array([3.0]),
        np.array([2.849394379747939, 0.45842242204463923]),
        np.array([-6.954028509809101, 2.489845061869568, -10.358996098473584]),
        np.array(
            [
                2.8029986275628964,
                0.5072464736228206,
                -0.3988312541770524,
                -0.04721187230404641,
            ]
        ),
        np.array(
            [
                -7.502846399306121,
                2.561846144803919,
                -11.627539656261098,
                -0.18268767659942256,
                0.030198172008377946,
            ]
        ),
        np.array(
            [
                -7.502846399306121,
                2.561846144803919,
                -11.627539656261098,
                -0.18268767659942256,
                0.030198172008377946,
                1.0,
            ]
        ),
        np.array(
            [
                -7.502846399306121,
                2.561846144803919,
                -11.627539656261098,
                -0.18268767659942256,
                0.030198172008377946,
                1.0,
                1.0,
            ]
        ),
    ),
    c_lower=(
        np.array([-14.155112264123755]),
        np.array([-17.97296035885952, -2.859693295451294]),
        np.array([147.12150275711716, -1.41221402718213, 71.68940251302358]),
        np.array(
            [
                165.43517024871676,
                -0.4592823456491126,
                42.90938336958603,
                -5.961986721573306,
            ]
        ),
        np.array(
            [
                24.854864614690072,
                -3.0009227002832186,
                47.4931110020768,
                5.5814197821558125,
                -0.6610691825249471,
            ]
        ),
        np.array(
            [
                30.91273214028599,
                -3.1208243349937974,
                77.79954646070892,
                34.28646028294783,
                -19.097331116725623,
                -28.087943162872662,
            ]
        ),
        np.array(
            [
                37.80277123390563,
                -3.2571969029072276,
                112.26918849496327,
                66.9347231244047,
                -40.06618937091002,
                -54.66780262877968,
                -9.48861652309627,
            ]
        ),
    ),
    α=np.array(
        [
            0.0,
            0.6358126895828704,
            0.4095798393397535,
            0.9769306725060716,
            0.4288403609558664,
            1.0,
            1.0,
            1.0,
        ]
    ),
    γ=np.array(
        [
            0.21193756319429014,
            -0.42387512638858027,
            -0.3384627126235924,
            1.8046452872882734,
            2.325825639765069,
            0.0,
            0.0,
            0.0,
        ]
    ),
    m_sol=np.array(
        [
            -7.502846399306121,
            2.561846144803919,
            -11.627539656261098,
            -0.18268767659942256,
            0.030198172008377946,
            1.0,
            1.0,
            0.0,
        ]
    ),
    m_error=np.array(
        [
            -7.502846399306121,
            2.561846144803919,
            -11.627539656261098,
            -0.18268767659942256,
            0.030198172008377946,
            1.0,
            1.0,
            1.0,
        ]
    ),
)


class Rodas5p(AbstractRosenbrock):
    r"""Rodas5p method.

    5th order Rosenbrock method for solving stiff equations. Uses third-order Hermite
    polynomial interpolation for dense output.

    ??? cite "Reference"

        @article{Steinebach2023,
          author  = {Steinebach, Gerd},
          title   = {Construction of Rosenbrock--Wanner method Rodas5P and numerical benchmarks within the Julia Differential Equations package},
          journal = {BIT Numerical Mathematics},
          year    = {2023},
          volume  = {63},
          number  = {2},
          pages   = {27},
          doi     = {10.1007/s10543-023-00967-x},
          url     = {https://doi.org/10.1007/s10543-023-00967-x},
          issn    = {1572-9125},
          date    = {2023-04-17}
        }

    """

    tableau: ClassVar[RosenbrockTableau] = _tableau

    def order(self, terms):
        del terms
        return 5


Rodas5p.__init__.__doc__ = """**Arguments:** None"""
